In [3]:
#import libraries 
%matplotlib inline 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
#Create a raw data frame 
raw_data = {'first_name': ['Hamsini','Divya','Sam','Deepak','Siddharth'], 
             'last_name': ['San','Sam','Kumar','Raj','mariner'],
              'age':[40,40,30,20,25],
              'num of children':[40,40,30,20,25],
              'num of pets':[40,40,30,20,25]}
df = pd.DataFrame(raw_data, columns = ['first_name','last_name', 'age', 'num of children', 'num of pets'])
df

  first_name last_name  age  num of children  num of pets
0    Hamsini       San   40               40           40
1      Divya       Sam   40               40           40
2        Sam     Kumar   30               30           30
3     Deepak       Raj   20               20           20
4  Siddharth   mariner   25               25           25

In [7]:
#index of the row with the highest value 
df['age'].idxmin()

3

In [8]:
df['num of children'].idxmax()

0

# CREATE A PIPELINE IN PANDAS

In [15]:
import pandas as pd
#create an empty dataframe 
df = pd.DataFrame()

#create a column
df['name'] = ['Ham','Div','Aish','Ben']
df['employed'] = ['Yes','Yes','No','No']
df['age'] = [25, 25,30,24]
df

   name employed  age
0   Ham      Yes   25
1   Div      Yes   25
2  Aish       No   30
3   Ben       No   24

In [16]:
#create a function 
def mean_age_by_group(dataframe,col):
    return dataframe.groupby(col).mean()

In [17]:
#create a function 
def uppercase_column_name(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    #return dataframe 
    return dataframe

In [13]:
#create a pipeline that applies both the functions 
(df.pipe(mean_age_by_group,col ='employed').pipe(uppercase_column_name))

          AGE
employed
No         27
Yes        25

In [19]:
#List unique values in a pandas column

In [20]:
import pandas as pd

In [25]:
raw_data = {'Name': ['Liam', 'Sasha', 'Liam'],
           'year' : [2000,2003,2004],
           'cartype' : [3,1,5]}
df = pd.DataFrame(raw_data, columns = ['Name','year', 'cartype'])
df

    Name  year  cartype
0   Liam  2000        3
1  Sasha  2003        1
2   Liam  2004        5

In [28]:
df.Name.unique()

array(['Liam', 'Sasha'], dtype=object)

In [38]:
#Replacing Values in Pandas
import pandas as pd
import numpy as np 
raw_data = {'Fisrt_Name': ['Liam', 'Sasha', 'Liam'],
           'Last_Name' : ['La', 'San', 'Siam'],
           'visit1spend' : [14.50,13.45,17.90],
           'visit2spend' : [14.90,13.55,-18.80]}
df = pd.DataFrame(raw_data, columns = ['Fisrt_Name','Last_Name', 'visit1spend','visit2spend'])
df

  Fisrt_Name Last_Name  visit1spend  visit2spend
0       Liam        La        14.50        14.90
1      Sasha       San        13.45        13.55
2       Liam      Siam        17.90       -18.80

In [40]:
df.replace(-18.80,np.nan)

  Fisrt_Name Last_Name  visit1spend  visit2spend
0       Liam        La        14.50        14.90
1      Sasha       San        13.45        13.55
2       Liam      Siam        17.90          NaN

In [43]:
#Replacing Values in Pandas
import pandas as pd
import numpy as np 
raw_data = {'Fisrt_Name': ['Liam', 'Sasha', 'Liam'],
           'Last_Name' : ['La', 'San', 'Siam'],
           'visit1spend' : [14.50,'?',17.90],
           'visit2spend' : [14.90,'?','?']}
df = pd.DataFrame(raw_data, columns = ['Fisrt_Name','Last_Name', 'visit1spend','visit2spend'])
df

  Fisrt_Name Last_Name visit1spend visit2spend
0       Liam        La        14.5        14.9
1      Sasha       San           ?           ?
2       Liam      Siam        17.9           ?

In [45]:
df.replace('?',np.nan)

  Fisrt_Name Last_Name  visit1spend  visit2spend
0       Liam        La         14.5         14.9
1      Sasha       San          NaN          NaN
2       Liam      Siam         17.9          NaN

Drop a column with a certain string

In [49]:
import pandas as pd 
raw_data = {'person': ['Liam', 'Sasha', 'Liam'],
           'place' : ['Los Altos', 'Las Vegas', 'San Diego'],
           'age' : [20,21,23]}
df = pd.DataFrame(raw_data, columns = ['person','place','age'])
df

  person      place  age
0   Liam  Los Altos   20
1  Sasha  Las Vegas   21
2   Liam  San Diego   23

In [51]:
cols = [c for c in df.columns if c.lower()[:3]!='pla']
df = df[cols]
df

  person  age
0   Liam   20
1  Sasha   21
2   Liam   23

In [52]:
#Assign a new name to the column
import pandas as pd
raw_data = {'name': ['Liam', 'Sasha', 'Liam'],
           'age' : [20,21,23]}
df = pd.DataFrame(raw_data, columns = ['name','age'])
df

    name  age
0   Liam   20
1  Sasha   21
2   Liam   23

In [53]:
df['color'] = ['red','orange','yellow']
df

    name  age   color
0   Liam   20     red
1  Sasha   21  orange
2   Liam   23  yellow

In [62]:
#Correlation matrix of pandas 
import pandas as pd 
raw_data = {'Name': ['Ham','Priya','Anu'],
           'Price': [100,200,400],
           'item' : [1,2,3],
           'age' : [20,21,23]}
df = pd.DataFrame(raw_data, columns = ['Name','Price','item','age'])
df

    Name  Price  item  age
0    Ham    100     1   20
1  Priya    200     2   21
2    Anu    400     3   23

In [63]:
df.corr()

          Price      item       age
Price  1.000000  0.981981  1.000000
item   0.981981  1.000000  0.981981
age    1.000000  0.981981  1.000000

In [65]:
df.corr(method='pearson')

          Price      item       age
Price  1.000000  0.981981  1.000000
item   0.981981  1.000000  0.981981
age    1.000000  0.981981  1.000000

In [66]:
df.corr(method='kendall')

       Price  item  age
Price    1.0   1.0  1.0
item     1.0   1.0  1.0
age      1.0   1.0  1.0

In [67]:
df.corr(method='spearman')

       Price  item  age
Price    1.0   1.0  1.0
item     1.0   1.0  1.0
age      1.0   1.0  1.0